; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v2 ?v1)
             (pred_11 ?v7 ?v10)
             (pred_12 ?v2 ?v10)
             (pred_5 ?v11 ?v2 )
	     (pred_4 ?v2)
             (pred_7 ?v8)
             (pred_10 ?v7)
             (pred_2 ?v10)
             (pred_8 ?v2)
             (pred_9 ?v7)
             (pred_3 ?v2)
             (pred_6 ))



(:action op_3
:parameters (?v13 ?v9 ?v4 ?v12)
:precondition (and (pred_7 ?v13) (pred_7 ?v9) (pred_10 ?v4) (pred_2 ?v12)
          (pred_1 ?v13 ?v9) (pred_11 ?v4 ?v12)
                   (pred_12 ?v9 ?v12) (pred_4 ?v13) 
                   (pred_8 ?v9) (pred_9 ?v4))
:effect (and  (pred_3 ?v9) (not (pred_8 ?v9))))


(:action op_2
:parameters (?v13 ?v5)
:precondition (and (pred_7 ?v13) (pred_7 ?v5)
               (pred_4 ?v13) (pred_1 ?v13 ?v5) (pred_3 ?v5))
:effect (and (pred_4 ?v5) (not (pred_4 ?v13))))

(:action op_1
:parameters (?v13 ?v4)
:precondition (and (pred_7 ?v13) (pred_10 ?v4) 
                  (pred_4 ?v13) (pred_5 ?v4 ?v13) (pred_6 ))
:effect (and (pred_9 ?v4)
   (not (pred_5 ?v4 ?v13)) (not (pred_6 ))))


(:action op_4
:parameters (?v13 ?v3 ?v6)
:precondition (and (pred_7 ?v13) (pred_10 ?v3) (pred_10 ?v6)
                  (pred_4 ?v13) (pred_9 ?v6) (pred_5 ?v3 ?v13))
:effect (and (pred_9 ?v3) (pred_5 ?v6 ?v13)
        (not (pred_9 ?v6)) (not (pred_5 ?v3 ?v13))))

(:action op_5
:parameters (?v13 ?v4)
:precondition (and (pred_7 ?v13) (pred_10 ?v4) 
                  (pred_4 ?v13) (pred_9 ?v4))
:effect (and (pred_6 ) (pred_5 ?v4 ?v13) (not (pred_9 ?v4)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_13 obj_19 obj_18 obj_10 obj_11 obj_08 obj_01 obj_09 obj_16 obj_05 obj_06 obj_15 obj_14 obj_12 obj_04
    obj_20 obj_07 obj_02
    obj_22 obj_03 obj_17
    )

    (:init
       (pred_6)

       (pred_7 obj_21)
       (pred_7 obj_13)
       (pred_7 obj_19)
       (pred_7 obj_18)
       (pred_7 obj_10)
       (pred_7 obj_11)
       (pred_7 obj_08)
       (pred_7 obj_01)
       (pred_7 obj_09)
       (pred_7 obj_16)
       (pred_7 obj_05)
       (pred_7 obj_06)
       (pred_7 obj_15)
       (pred_7 obj_14)
       (pred_7 obj_12)
       (pred_7 obj_04)
       (pred_2 obj_20)
       (pred_2 obj_07)
       (pred_2 obj_02)
       (pred_10 obj_22)
       (pred_10 obj_03)
       (pred_10 obj_17)

       (pred_1 obj_21 obj_10)
       (pred_1 obj_21 obj_13)
       (pred_1 obj_13 obj_11)
       (pred_1 obj_13 obj_19)
       (pred_1 obj_13 obj_21)
       (pred_1 obj_19 obj_08)
       (pred_1 obj_19 obj_18)
       (pred_1 obj_19 obj_13)
       (pred_1 obj_18 obj_01)
       (pred_1 obj_18 obj_19)
       (pred_1 obj_10 obj_09)
       (pred_1 obj_10 obj_11)
       (pred_1 obj_10 obj_21)
       (pred_1 obj_11 obj_16)
       (pred_1 obj_11 obj_08)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_11 obj_10)
       (pred_1 obj_08 obj_05)
       (pred_1 obj_08 obj_01)
       (pred_1 obj_08 obj_19)
       (pred_1 obj_08 obj_11)
       (pred_1 obj_01 obj_06)
       (pred_1 obj_01 obj_18)
       (pred_1 obj_01 obj_08)
       (pred_1 obj_09 obj_15)
       (pred_1 obj_09 obj_16)
       (pred_1 obj_09 obj_10)
       (pred_1 obj_16 obj_14)
       (pred_1 obj_16 obj_05)
       (pred_1 obj_16 obj_11)
       (pred_1 obj_16 obj_09)
       (pred_1 obj_05 obj_12)
       (pred_1 obj_05 obj_06)
       (pred_1 obj_05 obj_08)
       (pred_1 obj_05 obj_16)
       (pred_1 obj_06 obj_04)
       (pred_1 obj_06 obj_01)
       (pred_1 obj_06 obj_05)
       (pred_1 obj_15 obj_14)
       (pred_1 obj_15 obj_09)
       (pred_1 obj_14 obj_12)
       (pred_1 obj_14 obj_16)
       (pred_1 obj_14 obj_15)
       (pred_1 obj_12 obj_04)
       (pred_1 obj_12 obj_05)
       (pred_1 obj_12 obj_14)
       (pred_1 obj_04 obj_06)
       (pred_1 obj_04 obj_12)
       (pred_8 obj_15)
       (pred_8 obj_11)
       (pred_8 obj_19)
       (pred_12  obj_15 obj_20)
       (pred_12  obj_11 obj_07)
       (pred_12  obj_19 obj_02)
       (pred_3 obj_21)
       (pred_3 obj_13)
       (pred_3 obj_18)
       (pred_3 obj_10)
       (pred_3 obj_08)
       (pred_3 obj_01)
       (pred_3 obj_09)
       (pred_3 obj_16)
       (pred_3 obj_05)
       (pred_3 obj_06)
       (pred_3 obj_14)
       (pred_3 obj_12)
       (pred_3 obj_04)

       (pred_11  obj_22 obj_20)
       (pred_11  obj_03 obj_07)
       (pred_11  obj_17 obj_02)
       (pred_5 obj_22 obj_18)
       (pred_5 obj_03 obj_06)
       (pred_5 obj_17 obj_16)
       (pred_4 obj_01)
    )

    (:goal (and
       (pred_5 obj_22 obj_13)
       (pred_5 obj_03 obj_21)
    ))
(:constraints
  (always (not (pred_4 obj_05)))
)
)

; plan
1. (op_2 obj_01 obj_06)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_06)
   goals met: 0 of 2
2. (op_1 obj_06 obj_03)
   deleted: (pred_5 obj_03 obj_06) (pred_6)
   added: (pred_9 obj_03)
   goals met: 0 of 2
3. (op_2 obj_06 obj_01)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_01)
   goals met: 0 of 2
4. (op_2 obj_01 obj_08)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_08)
   goals met: 0 of 2
5. (op_3 obj_08 obj_11 obj_03 obj_07)
   deleted: (pred_8 obj_11)
   added: (pred_3 obj_11)
   goals met: 0 of 2
6. (op_2 obj_08 obj_01)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_01)
   goals met: 0 of 2
7. (op_2 obj_01 obj_18)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_18)
   goals met: 0 of 2
8. (op_4 obj_18 obj_22 obj_03)
   deleted: (pred_9 obj_03) (pred_5 obj_22 obj_18)
   added: (pred_9 obj_22) (pred_5 obj_03 obj_18)
   goals met: 0 of 2
9. (op_2 obj_18 obj_01)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_01)
   goals met: 0 of 2
10. (op_2 obj_01 obj_08)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_08)
   goals met: 0 of 2
11. (op_2 obj_08 obj_11)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_11)
   goals met: 0 of 2
12. (op_2 obj_11 obj_13)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_13)
   goals met: 0 of 2
13. (op_5 obj_13 obj_22)
   deleted: (pred_9 obj_22)
   added: (pred_6) (pred_5 obj_22 obj_13)
   goals met: 1 of 2
14. (op_2 obj_13 obj_11)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_11)
   goals met: 1 of 2
15. (op_2 obj_11 obj_08)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_08)
   goals met: 1 of 2
16. (op_2 obj_08 obj_01)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_01)
   goals met: 1 of 2
17. (op_2 obj_01 obj_18)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_18)
   goals met: 1 of 2
18. (op_1 obj_18 obj_03)
   deleted: (pred_5 obj_03 obj_18) (pred_6)
   added: (pred_9 obj_03)
   goals met: 1 of 2
19. (op_2 obj_18 obj_01)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_01)
   goals met: 1 of 2
20. (op_2 obj_01 obj_08)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_08)
   goals met: 1 of 2
21. (op_2 obj_08 obj_11)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_11)
   goals met: 1 of 2
22. (op_2 obj_11 obj_13)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_13)
   goals met: 1 of 2
23. (op_2 obj_13 obj_21)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_21)
   goals met: 1 of 2
24. (op_5 obj_21 obj_03)
   deleted: (pred_9 obj_03)
   added: (pred_6) (pred_5 obj_03 obj_21)
   goals met: 2 of 2
